Tekla Open API Reference for Tekla Structures 2025
IEvents Methods
The IEvents type exposes the following members.
Methods
Name | Description
Register
 Registers the instance to listen to the specified events.
UnRegister
 Unregisters the instance from listening to events.
Top
See Also
Reference
IEvents Interface
Tekla.Structures.Drawing Namespace